jbates35/stm32f4_board_examples/Src/main.c
/**
 ****************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

// NOTE:
// Where I am at right now:
// -DMA for some reason faults out with the FIFO buffer. This does not happen with it during ADC.
// -I can only send a message once. After sending one message, I cannot re-enable the DMA stream.
// -In circular mode, I can make an niterrupt which stops the DMA stream until we're ready again. THis seems to work
// okay.

#include "main.h"

#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "stm32f446xx.h"
#include "stm32f446xx_dma.h"
#include "stm32f446xx_gpio.h"
#include "stm32f446xx_spi.h"

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
#warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#define SPI_PORT SPI1
#define SPI_BAUD_RATE 0b100

#define SPI_GPIO_PORT GPIOA
#define SPI_GPIO_CLK_PIN 5
#define SPI_GPIO_MISO_PIN 6
#define SPI_GPIO_MOSI_PIN 7

#define SPI_GPIO_NSS_PORT GPIOA
#define SPI_GPIO_NSS_PIN 4

#define DMA_SPI_TX_STREAM DMA2_Stream3
#define DMA_SPI_RX_STREAM DMA2_Stream2

// command codes
#define COMMAND_LED_CTRL 0x50
#define COMMAND_SENSOR_READ 0x51
#define COMMAND_LED_READ 0x52
#define COMMAND_PRINT 0x53
#define COMMAND_ID_READ 0x54

#define LED_ON 1
#define LED_OFF 0

#define NACK 0xA5
#define ACK 0xF5

#define LED_ON 1
#define LED_OFF 0
void spi_master_setup_test();
void spi_tx_in_for_loop();

void spi_driver_setup_interrupts();

void spi_dma_driver_setup_master(uint8_t *in_arr, uint8_t *out_arr, uint16_t elements);
void spi_master_dma_exti_handler();
void spi_int_func(void);
void spi_start_int(SPI_TypeDef *spi_reg);

uint8_t mcp3008_dma_tx[3] = {1, (1 << 7) | (1 << 4), 0};
uint8_t mcp3008_dma_rx[3];
uint8_t counter;
uint8_t spi_finished_flag;

int main(void) {
  // AFTER THIS, TRY OUT SLAVE MODE
  // NEED TO GET INTERRUPT GOING
  // ALSO NEED TO TEST OUT 16b

  spi_driver_setup_interrupts();

  // spi_enable_interrupt(SPI_PORT, SPI_INTERRUPT_TYPE_TX, SPI_ENABLE);
  spi_enable_interrupt(SPI_PORT, SPI_INTERRUPT_TYPE_RX, SPI_ENABLE);

  // Consider using void* for setting up
  spi_setup_interrupt(SPI_PORT, SPI_INTERRUPT_TYPE_TX, (char *)&mcp3008_dma_tx, 3);
  spi_setup_interrupt(SPI_PORT, SPI_INTERRUPT_TYPE_RX, (char *)&mcp3008_dma_rx, 3);

  spi_set_interrupt_callback(SPI_PORT, SPI_INTERRUPT_TYPE_RX, spi_int_func);
  spi_set_interrupt_callback(SPI_PORT, SPI_INTERRUPT_TYPE_TX, spi_int_func);

  spi_finished_flag = 0;
  counter = 0;

  for (;;) {
    if (spi_finished_flag) {
      spi_finished_flag = 0;
      uint16_t adc_val = 0x3FF & *((uint16_t *)(mcp3008_dma_rx + 1));
      int breakpointhere = 0;
    }
    // spi_start_interrupt_transfer(SPI_PORT);
    spi_start_int(SPI_PORT);
    WAIT(SLOW);
  }
}

void spi_int_func(void) { int asdf = 0; }

void SPI1_IRQHandler(void) {
  if (spi_irq_handling(SPI_PORT) == 1) {
    uint16_t rx_word = SPI_PORT->DR;
    mcp3008_dma_rx[counter] = (uint8_t)rx_word;
    counter++;

    if (counter == 3) {
      counter = 0;
      spi_finished_flag = 1;
      SPI_PORT->CR1 &= ~(1 << SPI_CR1_SPE_Pos);
      GPIO_set_output(SPI_GPIO_NSS_PORT, SPI_GPIO_NSS_PIN, 1);
    } else {
      SPI_PORT->DR = (uint16_t)(mcp3008_dma_tx[0] & 0xFF);
    }
  }
}

void spi_start_int(SPI_TypeDef *spi_reg) {
  GPIO_set_output(SPI_GPIO_NSS_PORT, SPI_GPIO_NSS_PIN, 0);
  spi_reg->CR1 |= (1 << SPI_CR1_SPE_Pos);
  while (spi_reg->SR & (1 << SPI_SR_BSY_Pos));
  spi_reg->DR = (uint16_t)(mcp3008_dma_tx[0] & 0xFF);
}

void spi_driver_setup_interrupts() {
  // 1.Write proper GPIO registers: Configure GPIO for MOSI, MISO and SCK pins.
  GPIO_peri_clock_control(SPI_GPIO_PORT, GPIO_CLOCK_ENABLE);
  GPIO_peri_clock_control(SPI_GPIO_NSS_PORT, GPIO_CLOCK_ENABLE);
  GPIOConfig_t default_gpio_cfg = {.mode = GPIO_MODE_ALTFN,
                                   .speed = GPIO_SPEED_HIGH,
                                   .float_resistor = GPIO_PUPDR_NONE,
                                   .output_type = GPIO_OP_TYPE_PUSHPULL,
                                   .alt_func_num = 5};
  GPIOHandle_t spi_gpio_clk_handle = {.p_GPIO_addr = SPI_GPIO_PORT, .cfg = default_gpio_cfg};
  spi_gpio_clk_handle.cfg.pin_number = SPI_GPIO_CLK_PIN;
  GPIO_init(&spi_gpio_clk_handle);

  GPIOHandle_t spi_gpio_miso_handle = {.p_GPIO_addr = SPI_GPIO_PORT, .cfg = default_gpio_cfg};
  spi_gpio_miso_handle.cfg.pin_number = SPI_GPIO_MISO_PIN;
  GPIO_init(&spi_gpio_miso_handle);

  GPIOHandle_t spi_gpio_mosi_handle = {.p_GPIO_addr = SPI_GPIO_PORT, .cfg = default_gpio_cfg};
  spi_gpio_mosi_handle.cfg.pin_number = SPI_GPIO_MOSI_PIN;
  GPIO_init(&spi_gpio_mosi_handle);

  GPIOHandle_t spi_gpio_nss_handle = {.p_GPIO_addr = SPI_GPIO_NSS_PORT, .cfg = default_gpio_cfg};
  spi_gpio_nss_handle.cfg.pin_number = SPI_GPIO_NSS_PIN;
  spi_gpio_nss_handle.cfg.alt_func_num = 0;
  spi_gpio_nss_handle.cfg.mode = GPIO_MODE_OUT;
  GPIO_init(&spi_gpio_nss_handle);
  GPIO_set_output(SPI_GPIO_NSS_PORT, SPI_GPIO_NSS_PIN, 1);

  spi_peri_clock_control(SPI_PORT, SPI_PERI_CLOCK_ENABLE);
  SPIHandle_t spi_handle = {.addr = SPI_PORT,
                            .cfg = {.baud_divisor = SPI_BAUD_DIVISOR_32,
                                    .bus_config = SPI_BUS_CONFIG_FULL_DUPLEX,
                                    .device_mode = SPI_DEVICE_MODE_MASTER,
                                    .dff = SPI_DFF_8_BIT,
                                    .ssm = SPI_SSM_ENABLE,
                                    .dma_setup = {.rx = SPI_DISABLE, .tx = SPI_DISABLE},
                                    .interrupt_setup.en = SPI_DISABLE,
                                    .enable_on_init = SPI_DISABLE}};
  spi_init(&spi_handle);

  NVIC_EnableIRQ(SPI1_IRQn);
}
